# Pandas 进阶

## 1. Group操作：数据聚合

**1.1 生成DataFrame**

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns;

In [2]:
period = pd.date_range('2017-1-1', periods=10000, freq='D')
df = pd.DataFrame(np.random.randn(10000, 4),
                  columns=['Data1', 'Data2', 'Data3', 'Data4'],
                  index = period)

In [3]:
df.head()      #快速预览前5行；

               Data1     Data2     Data3     Data4
2017-01-01 -0.087366  0.750176 -0.379425  0.024651
2017-01-02  0.131879 -0.232675  0.777068  0.905740
2017-01-03 -1.442843  0.430868 -0.913256  0.749456
2017-01-04 -0.723203  0.614766  0.926408  1.186893
2017-01-05  1.730733 -1.329401  0.258370  0.034385

#### 1.2 新增一例用于Group操作

In [4]:
df['group1'] = np.random.choice(['A', 'B', 'C', 'D'], 10000)       #np.random.choice

In [5]:
df.tail()

               Data1     Data2     Data3     Data4 group1
2044-05-14  0.705064  0.540020  2.064975 -1.119345      D
2044-05-15  0.404744 -0.325626  0.312076 -0.472220      C
2044-05-16 -0.918056  0.586094  1.015111  0.595851      A
2044-05-17 -1.127972  1.187500  2.046048 -0.230047      B
2044-05-18 -1.135571 -0.611361  1.251209  0.049124      A

In [6]:
df.head()

               Data1     Data2     Data3     Data4 group1
2017-01-01 -0.087366  0.750176 -0.379425  0.024651      B
2017-01-02  0.131879 -0.232675  0.777068  0.905740      C
2017-01-03 -1.442843  0.430868 -0.913256  0.749456      D
2017-01-04 -0.723203  0.614766  0.926408  1.186893      B
2017-01-05  1.730733 -1.329401  0.258370  0.034385      C

**1.3 生成DataFrameGroupBy对象**

In [7]:
grouped = df.groupby('group1')     #df.groupby();必背；

In [8]:
grouped

In [9]:
type(grouped)

pandas.core.groupby.DataFrameGroupBy

In [10]:
grouped.size()           #每组元素数量

group1
A    2484
B    2504
C    2516
D    2496
dtype: int64

#### 1.4 Group对象的聚合运算

In [11]:
grouped.sum()

             Data1      Data2      Data3      Data4
group1
A       -51.087933 -51.918248   2.702745 -53.884622
B      -108.953172 -30.354278  81.207792  60.558573
C       117.411917   9.847603  14.600024  59.225704
D       148.973812 -31.919310 -78.487162 -50.759946

In [12]:
grouped.max()

           Data1     Data2     Data3     Data4
group1
A       3.224384  3.710282  2.927806  3.046383
B       3.407049  3.256985  3.157959  3.086147
C       3.550821  4.008885  3.686898  3.123823
D       3.602945  3.446568  2.885259  3.414358

In [13]:
grouped.mean()

           Data1     Data2     Data3     Data4
group1
A      -0.020567 -0.020901  0.001088 -0.021693
B      -0.043512 -0.012122  0.032431  0.024185
C       0.046666  0.003914  0.005803  0.023540
D       0.059685 -0.012788 -0.031445 -0.020337

In [14]:
grouped.describe()        #整体数据特征概览；

         Data1                                                              \
         count      mean       std       min       25%       50%       75%
group1
A       2484.0 -0.020567  1.025724 -3.420039 -0.688568 -0.046274  0.662961
B       2504.0 -0.043512  0.997732 -3.450132 -0.695222 -0.024318  0.617743
C       2516.0  0.046666  0.998662 -3.317798 -0.601002  0.048769  0.733632
D       2496.0  0.059685  0.983243 -3.690770 -0.592203  0.060983  0.698663

                   Data2              ...        Data3             Data4  \
             max   count      mean    ...          75%       max   count
group1                                ...
A       3.224384  2484.0 -0.020901    ...     0.691994  2.927806  2484.0
B       3.407049  2504.0 -0.012122    ...     0.681168  3.157959  2504.0
C       3.550821  2516.0  0.003914    ...     0.692453  3.686898  2516.0
D       3.602945  2496.0 -0.012788    ...     0.649612  2.885259  2496.0


            mean       std       min       25%       50%       75%       max
group1
A      -0.021693  1.007885 -3.454421 -0.706990 -0.019068  0.652250  3.046383
B       0.024185  0.995803 -3.376444 -0.636394  0.020290  0.721698  3.086147
C       0.023540  1.011381 -3.774805 -0.659506  0.030726  0.708646  3.123823
D      -0.020337  0.997344 -3.184199 -0.707048 -0.033138  0.669632  3.414358

[4 rows x 32 columns]

In [15]:
np.transpose(grouped.describe() )

group1                 A            B            C            D
Data1 count  2484.000000  2504.000000  2516.000000  2496.000000
      mean     -0.020567    -0.043512     0.046666     0.059685
      std       1.025724     0.997732     0.998662     0.983243
      min      -3.420039    -3.450132    -3.317798    -3.690770
      25%      -0.688568    -0.695222    -0.601002    -0.592203
      50%      -0.046274    -0.024318     0.048769     0.060983
      75%       0.662961     0.617743     0.733632     0.698663
      max       3.224384     3.407049     3.550821     3.602945
Data2 count  2484.000000  2504.000000  2516.000000  2496.000000
      mean     -0.020901    -0.012122     0.003914    -0.012788
      std       0.997098     1.000361     1.009671     0.994943
      min      -3.804905    -3.355539    -3.680402    -3.416646
      25%      -0.671319    -0.692734    -0.668544    -0.698412
      50%      -0.020200    -0.008346    -0.004304    -0.006995
      75%       0.637695     0.684088     0.692390     0.672096
      max       3.710282     3.256985     4.008885     3.446568
Data3 count  2484.000000  2504.000000  2516.000000  2496.000000
      mean      0.001088     0.032431     0.005803    -0.031445
      std       1.007873     0.988958     0.991132     0.996427
      min      -3.634164    -3.315491    -3.427143    -3.143272
      25%      -0.670071    -0.638669    -0.674317    -0.718012
      50%      -0.007976     0.037955     0.014914    -0.050367
      75%       0.691994     0.681168     0.692453     0.649612
      max       2.927806     3.157959     3.686898     2.885259
Data4 count  2484.000000  2504.000000  2516.000000  2496.000000
      mean     -0.021693     0.024185     0.023540    -0.020337
      std       1.007885     0.995803     1.011381     0.997344
      min      -3.454421    -3.376444    -3.774805    -3.184199
      25%      -0.706990    -0.636394    -0.659506    -0.707048
      50%      -0.019068     0.020290     0.030726    -0.033138
      75%       0.652250     0.721698     0.708646     0.669632
      max       3.046383     3.086147     3.123823     3.414358

#### 1.5 选择Group对象中的数据

In [16]:
grouped.get_group('A').head()    #get_group()

               Data1     Data2     Data3     Data4
2017-01-06 -0.825978  0.106076  1.013872  0.351776
2017-01-09  0.473484  0.652168  1.131776 -0.538572
2017-01-14  0.184861  0.504367 -1.905872  0.237773
2017-01-16 -0.081502 -1.419412  0.657227  0.801462
2017-01-18 -0.452682  0.316673 -0.524348 -0.209224

In [17]:
grouped.get_group('B').head()

               Data1     Data2     Data3     Data4
2017-01-01 -0.087366  0.750176 -0.379425  0.024651
2017-01-04 -0.723203  0.614766  0.926408  1.186893
2017-01-07  0.511106 -0.801256 -0.187299  0.768784
2017-01-11 -1.329224 -1.493389  1.685744  0.833335
2017-01-15  0.068041 -1.952100  0.753815  1.380759

In [18]:
grouped.            #tab键查看对应其对应的方法

SyntaxError: invalid syntax (<ipython-input-18-1ad44e158c3e>, line 1)

#### 1.6 双重Group

In [19]:
df['group2'] = np.random.choice(['Python','C++','Java'], 10000)

In [20]:
df.head()

               Data1     Data2     Data3     Data4 group1 group2
2017-01-01 -0.087366  0.750176 -0.379425  0.024651      B   Java
2017-01-02  0.131879 -0.232675  0.777068  0.905740      C    C++
2017-01-03 -1.442843  0.430868 -0.913256  0.749456      D    C++
2017-01-04 -0.723203  0.614766  0.926408  1.186893      B   Java
2017-01-05  1.730733 -1.329401  0.258370  0.034385      C    C++

In [21]:
grouped = df.groupby(['group1', 'group2'])
grouped.size()                                    #多组分类

group1  group2
A       C++       846
        Java      809
        Python    829
B       C++       860
        Java      797
        Python    847
C       C++       836
        Java      821
        Python    859
D       C++       838
        Java      838
        Python    820
dtype: int64

In [22]:
grouped.max()

                  Data1     Data2     Data3     Data4
group1 group2
A      C++     3.011414  2.712424  2.643399  2.882361
       Java    3.097997  3.317769  2.854690  2.606897
       Python  3.224384  3.710282  2.927806  3.046383
B      C++     3.392189  2.785912  3.085653  2.809749
       Java    2.656453  3.256985  3.157959  2.816715
       Python  3.407049  2.779499  2.617100  3.086147
C      C++     2.464372  2.731115  3.686898  2.722253
       Java    3.550821  4.008885  2.800321  3.123823
       Python  2.981361  2.943703  3.388399  2.921264
D      C++     3.602945  3.446568  2.885259  3.414358
       Java    2.860995  3.107113  2.653237  3.013761
       Python  3.365076  3.138205  2.721720  3.198213

In [23]:
grouped.min()

                  Data1     Data2     Data3     Data4
group1 group2
A      C++    -3.173421 -3.804905 -3.632908 -3.445288
       Java   -3.420039 -3.442788 -3.634164 -3.265135
       Python -2.944583 -3.024369 -3.058646 -3.454421
B      C++    -3.021176 -3.355539 -2.828766 -3.376444
       Java   -3.450132 -3.048031 -3.209621 -3.185751
       Python -2.904857 -3.098189 -3.315491 -2.972508
C      C++    -2.893698 -3.680402 -3.027903 -3.774805
       Java   -2.849336 -3.315434 -3.427143 -3.269451
       Python -3.317798 -3.201158 -3.361708 -3.030751
D      C++    -3.690770 -3.170991 -3.143272 -3.175899
       Java   -3.132774 -3.416646 -2.779468 -3.184199
       Python -2.911364 -3.305807 -3.119343 -3.013955

In [24]:
grouped.agg([np.max, np.sum])               #自定义聚合.分类汇总、查看，可以自定义聚合；

                  Data1                Data2                Data3             \
                   amax        sum      amax        sum      amax        sum
group1 group2
A      C++     3.011414   7.351947  2.712424 -70.636135  2.643399  37.615984
       Java    3.097997 -44.273662  3.317769  27.313770  2.854690 -38.639703
       Python  3.224384 -14.166219  3.710282  -8.595883  2.927806   3.726463
B      C++     3.392189  -9.904395  2.785912 -45.194813  3.085653  18.589881
       Java    2.656453 -64.657262  3.256985 -45.037253  3.157959  32.863107
       Python  3.407049 -34.391514  2.779499  59.877788  2.617100  29.754803
C      C++     2.464372  10.702868  2.731115 -48.678065  3.686898 -22.036846
       Java    3.550821  62.373364  4.008885  26.813095  2.800321  29.010128
       Python  2.981361  44.335686  2.943703  31.712573  3.388399   7.626741
D      C++     3.602945  46.804337  3.446568  -7.261428  2.885259 -48.181511
       Java    2.860995  56.194424  3.107113 -23.835559  2.653237  -4.900424
       Python  3.365076  45.975051  3.138205  -0.822323  2.721720 -25.405228

                  Data4
                   amax        sum
group1 group2
A      C++     2.882361  -1.303286
       Java    2.606897 -19.755325
       Python  3.046383 -32.826011
B      C++     2.809749  28.534814
       Java    2.816715  20.916063
       Python  3.086147  11.107696
C      C++     2.722253  21.556093
       Java    3.123823  44.728028
       Python  2.921264  -7.058417
D      C++     3.414358 -50.282149
       Java    3.013761   3.441924
       Python  3.198213  -3.919722

In [25]:
grouped.agg({'Data1':np.mean, 'Data2':np.max})

                  Data1     Data2
group1 group2
A      C++     0.008690  2.712424
       Java   -0.054726  3.317769
       Python -0.017088  3.710282
B      C++    -0.011517  2.785912
       Java   -0.081126  3.256985
       Python -0.040604  2.779499
C      C++     0.012802  2.731115
       Java    0.075972  4.008885
       Python  0.051613  2.943703
D      C++     0.055852  3.446568
       Java    0.067058  3.107113
       Python  0.056067  3.138205

### 2. Pandas中Concat, Join, Merge操作

#### 2.1 生成DataFrame

In [20]:
df1 = pd.DataFrame(['10', '20', '25', '30'], 
                    index=['a', 'b', 'c', 'd'],
                    columns=['PE',])
df1

   PE
a  10
b  20
c  25
d  30

In [25]:
df2 = pd.DataFrame(['2.5', '3.2', '2.5'], 
                    index=['a', 'd', 'g'],
                    columns=['PB',])
df2

    PB
a  2.5
d  3.2
g  2.5

#### 2.2 Concat操作

In [26]:
pd.concat((df1, df2))    #默认是直接拼接在后面；

    PB   PE
a  NaN   10
b  NaN   20
c  NaN   25
d  NaN   30
a  2.5  NaN
d  3.2  NaN
g  2.5  NaN

In [27]:
pd.concat((df1, df2),axis =1)          #横向拼接concat很有用，会自动匹配索引；join(Outer),并集；

    PE   PB
a   10  2.5
b   20  NaN
c   25  NaN
d   30  3.2
g  NaN  2.5

In [28]:
pd.concat((df1, df2), ignore_index=True)

    PB   PE
0  NaN   10
1  NaN   20
2  NaN   25
3  NaN   30
4  2.5  NaN
5  3.2  NaN
6  2.5  NaN

#### 2.3 Join操作

是根据两张表格的索引去进行合并

In [31]:
print(df1)
print(df2)

   PE
a  10
b  20
c  25
d  30
    PB
a  2.5
d  3.2
g  2.5

In [29]:
df1.join(df2)                     # left join = default,默认按照左边表格对齐；

   PE   PB
a  10  2.5
b  20  NaN
c  25  NaN
d  30  3.2

In [32]:
df1.join(df2, how='left')  # default，how控制的是按索引合并的方法；

   PE   PB
a  10  2.5
b  20  NaN
c  25  NaN
d  30  3.2

In [33]:
df2.join(df1)

    PB   PE
a  2.5   10
d  3.2   30
g  2.5  NaN

In [37]:
df = pd.DataFrame({'PE': df1['PE'], 'PB': df2['PB']})                    #使用DataFrame进行拼接操作
df

    PB   PE
a  2.5   10
b  NaN   20
c  NaN   25
d  3.2   30
g  2.5  NaN

In [34]:
df1.join(df2, how='right')

    PE   PB
a   10  2.5
d   30  3.2
g  NaN  2.5

In [35]:
df1.join(df2, how='inner')    #取交集，双方都有的才进行显示；

   PE   PB
a  10  2.5
d  30  3.2

In [36]:
df1.join(df2, how='outer')    #取并集，保留双方所有的内容；

    PE   PB
a   10  2.5
b   20  NaN
c   25  NaN
d   30  3.2
g  NaN  2.5

#### 2.4 Merge操作: 同等数量合并

按列来进行合并（也支持按index来进行合并）

In [39]:
df1

   PE
a  10
b  20
c  25
d  30

In [38]:
df2 = pd.DataFrame(['2.5', '3.2', '2.5', '2'], 
                    index=['a', 'b', 'c','d'],
                    columns=['PB',])
df2

    PB
a  2.5
b  3.2
c  2.5
d    2

In [52]:
roe = pd.Series([0.12, 0.06, 0.08,0.02], index=['a', 'b', 'c','d'])         #添加一列一列以进行合并
df1['ROE'] = roe    #新增一列用法；
df2['ROE'] = roe

In [53]:
df1

   PE   ROE
a  10  0.12
b  20  0.06
c  25  0.08
d  30  0.02

In [54]:
df2

    PB   ROE
a  2.5  0.12
b  3.2  0.06
c  2.5  0.08
d    2  0.02

In [55]:
pd.merge(df1, df2, on = 'ROE')        #会自动根据重复列进行merge，但是索引会重置；

   PE   ROE   PB
0  10  0.12  2.5
1  20  0.06  3.2
2  25  0.08  2.5
3  30  0.02    2

In [ ]:
# Merge合并的时候如果ROE不同的话，只会合并ROE相同的数据行；
roe1 = pd.Series([0.12, 0.06, 0.08,0.02], index=['a', 'b', 'c','d']) 
roe2 = pd.Series([0.2, 0.06, 0.08,0.02], index=['a', 'b', 'c','d'])     #添加一列一列以进行合并
df1['ROE'] = roe1    #新增一列用法；
df2['ROE'] = roe2

In [58]:
df1.join(df2, lsuffix = '_l')

   PE  ROE_l   PB   ROE
a  10   0.12  2.5  0.12
b  20   0.06  3.2  0.06
c  25   0.08  2.5  0.08
d  30   0.02    2  0.02

In [64]:
pd.merge(df1, df2, left_index=True, right_index=True, how='outer',suffixes=['_df1','_df2'])    
#merge也可以通过left_index，right_index进行按index索引,可以实现等价于join的形式；

   PE  ROE_df1   PB  ROE_df2
a  10     0.12  2.5     0.12
b  20     0.06  3.2     0.06
c  25     0.08  2.5     0.08
d  30     0.02    2     0.02

In [65]:
pd.merge(df1, df2, how='outer')       #ROE这一列数据两张表格相同，所以无法看出outer和其他合并类型的区别；

   PE   ROE   PB
0  10  0.12  2.5
1  20  0.06  3.2
2  25  0.08  2.5
3  30  0.02    2

#### 2.5 Merge操作: 非同等数量合并

In [3]:
df2 = pd.DataFrame(['2.5', '3.2', '2.5'], 
                    index=['a', 'b', 'c'],
                    columns=['PB',])
df2

    PB
a  2.5
b  3.2
c  2.5

In [2]:
df1 = pd.DataFrame(['10', '20', '25', '30'], 
                    index=['a', 'b', 'c', 'd'],
                    columns=['PE',])
df1

   PE
a  10
b  20
c  25
d  30

In [4]:
roe = pd.Series([0.12, 0.08, 0.06], index=['b', 'd', 'c'])         #添加一列一列以进行合并
df1['ROE'] = roe
df2['ROE'] = roe

In [5]:
df1

   PE   ROE
a  10   NaN
b  20  0.12
c  25  0.06
d  30  0.08

In [6]:
df2

    PB   ROE
a  2.5   NaN
b  3.2  0.12
c  2.5  0.06

In [12]:
pd.merge(df1, df2)                #join是按index合并，merge是按列合并；默认是inner

   PE   ROE   PB
0  10   NaN  2.5
1  20  0.12  3.2
2  25  0.06  2.5

In [13]:
pd.merge(df1, df2, on='ROE')  # default

   PE   ROE   PB
0  10   NaN  2.5
1  20  0.12  3.2
2  25  0.06  2.5

In [14]:
pd.merge(df1, df2, how='outer')

   PE   ROE   PB
0  10   NaN  2.5
1  20  0.12  3.2
2  25  0.06  2.5
3  30  0.08  NaN

In [18]:
df1.join(df2,rsuffix = '_df2', how = 'left')

   PE   ROE   PB  ROE_df2
a  10   NaN  2.5      NaN
b  20  0.12  3.2     0.12
c  25  0.06  2.5     0.06
d  30  0.08  NaN      NaN

In [20]:
pd.merge(df1, df2, left_index=True, right_index=True, how='left')    
#merge也可以通过left_index，right_index进行按index索引

   PE  ROE_x   PB  ROE_y
a  10    NaN  2.5    NaN
b  20   0.12  3.2   0.12
c  25   0.06  2.5   0.06
d  30   0.08  NaN    NaN

In [21]:
df1 = pd.DataFrame(['10', '20', '25', '30'], 
                    index=['a', 'b', 'c', 'd'],
                    columns=['PE',])
df1

   PE
a  10
b  20
c  25
d  30

In [22]:
df2 = pd.DataFrame(['2.5', '3.2', '2.5'], 
                    index=['a', 'b', 'c'],
                    columns=['PB',])
df2

    PB
a  2.5
b  3.2
c  2.5

In [23]:
roe = pd.Series([0.12, 0.08, 0.06], index=['b', 'd', 'c'])         #添加一列一列以进行合并
df1['ROE1'] = roe
df2['ROE2'] = roe

In [24]:
df1

   PE  ROE1
a  10   NaN
b  20  0.12
c  25  0.06
d  30  0.08

In [25]:
df2

    PB  ROE2
a  2.5   NaN
b  3.2  0.12
c  2.5  0.06

In [27]:
pd.merge(df1, df2, left_on='ROE1', right_on='ROE2')     #两张DataFrame列名是不同的，但是表示是同一个的意思；

   PE  ROE1   PB  ROE2
0  10   NaN  2.5   NaN
1  20  0.12  3.2  0.12
2  25  0.06  2.5  0.06

### 3. 层次化索引

In [28]:
df = pd.Series(np.random.randn(5),                 #定义层次化索引
               index=[['a', 'a', 'b','b', 'b'],
                      [1,2,1,2,3]])

In [29]:
df

a  1   -0.541225
   2    1.499903
b  1   -0.578726
   2    0.161935
   3    0.097446
dtype: float64

In [30]:
df.index

MultiIndex(levels=[['a', 'b'], [1, 2, 3]],
           labels=[[0, 0, 1, 1, 1], [0, 1, 0, 1, 2]])

In [31]:
df['b']                       # 使用层次化索引

1   -0.578726
2    0.161935
3    0.097446
dtype: float64

In [32]:
df['a']

1   -0.541225
2    1.499903
dtype: float64

层次化索引在数据重塑中的应用

In [33]:
df.unstack()                 # 使用unstack方法将数据重新排列

          1         2         3
a -0.541225  1.499903       NaN
b -0.578726  0.161935  0.097446

In [34]:
df.unstack().stack()         # stack是unstack方法的逆运算

a  1   -0.541225
   2    1.499903
b  1   -0.578726
   2    0.161935
   3    0.097446
dtype: float64

使用层次化索引进行聚合运算

In [35]:
df.sum(level=0)             # 按照level=0进行聚合运算

a    0.958678
b   -0.319345
dtype: float64

In [37]:
df.groupby(level=0).sum()           # 按照level=0进行聚合运算

a    0.958678
b   -0.319345
dtype: float64

In [36]:
df.sum(level=1)

1   -1.119952
2    1.661838
3    0.097446
dtype: float64